# Explore Data Files and API Endpoint

In [3]:
import pandas as pd
import json
import requests

### Read in files

In [10]:
with open("../data_files/cdw_sapp_customer.json", "r") as f:
    cust_data = json.loads(f.readline())
    print(cust_data)

with open("../data_files/cdw_sapp_credit.json", "r") as f:
    credit_data = json.loads(f.readline())
    print(credit_data)

with open("../data_files/cdw_sapp_branch.json", "r") as f:
    branch_data = json.loads(f.readline())
    print(branch_data)

resp = requests.get("https://raw.githubusercontent.com/platformps/LoanDataset/main/loan_data.json")
load_data = resp.json()[0]
print(load_data)

{'FIRST_NAME': 'Alec', 'MIDDLE_NAME': 'Wm', 'LAST_NAME': 'Hooper', 'SSN': 123456100, 'CREDIT_CARD_NO': '4210653310061055', 'APT_NO': '656', 'STREET_NAME': 'Main Street North', 'CUST_CITY': 'Natchez', 'CUST_STATE': 'MS', 'CUST_COUNTRY': 'United States', 'CUST_ZIP': '39120', 'CUST_PHONE': 1237818, 'CUST_EMAIL': 'AHooper@example.com', 'LAST_UPDATED': '2018-04-21T12:49:02.000-04:00'}
{'TRANSACTION_ID': 1, 'DAY': 14, 'MONTH': 2, 'YEAR': 2018, 'CREDIT_CARD_NO': '4210653349028689', 'CUST_SSN': 123459988, 'BRANCH_CODE': 114, 'TRANSACTION_TYPE': 'Education', 'TRANSACTION_VALUE': 78.9}
{'BRANCH_CODE': 1, 'BRANCH_NAME': 'Example Bank', 'BRANCH_STREET': 'Bridle Court', 'BRANCH_CITY': 'Lakeville', 'BRANCH_STATE': 'MN', 'BRANCH_ZIP': 55044, 'BRANCH_PHONE': '1234565276', 'LAST_UPDATED': '2018-04-18T16:51:47.000-04:00'}
{'Application_ID': 'LP001002', 'Gender': 'Male', 'Married': 'No', 'Dependents': '0', 'Education': 'Graduate', 'Self_Employed': 'No', 'Credit_History': 1, 'Property_Area': 'Urban', 'Income': 'medium', 'Application_Status': 'Y'}

### Get the column names to create the database tables (See the create_tables.sql file)

In [8]:
print(" ========= CUSTOMER DATA ========= ")
[print(k, ',') for k in cust_data.keys()]
print(" ========= CREDIT CARD DATA ========= ")
[print(k, ',') for k in credit_data.keys()]
print(" ========= BRANCH DATA ========= ")
[print(k, ',') for k in branch_data.keys()]
print(" ========= LOAN DATA ========= ")
[print(k, ',') for k in load_data.keys()]

 ========= CUSTOMER DATA =========
FIRST_NAME ,
MIDDLE_NAME ,
LAST_NAME ,
SSN ,
CREDIT_CARD_NO ,
APT_NO ,
STREET_NAME ,
CUST_CITY ,
CUST_STATE ,
CUST_COUNTRY ,
CUST_ZIP ,
CUST_PHONE ,
CUST_EMAIL ,
LAST_UPDATED ,
 ========= CREDIT CARD DATA =========
TRANSACTION_ID ,
DAY ,
MONTH ,
YEAR ,
CREDIT_CARD_NO ,
CUST_SSN ,
BRANCH_CODE ,
TRANSACTION_TYPE ,
TRANSACTION_VALUE ,
 ========= BRANCH DATA =========
BRANCH_CODE ,
BRANCH_NAME ,
BRANCH_STREET ,
BRANCH_CITY ,
BRANCH_STATE ,
BRANCH_ZIP ,
BRANCH_PHONE ,
LAST_UPDATED ,
 ========= LOAN DATA =========
Application_ID ,
Gender ,
Married ,
Dependents ,
Education ,
Self_Employed ,
Credit_History ,
Property_Area ,
Income ,
Application_Status ,

[None, None, None, None, None, None, None, None, None, None]

### Using the above columns

### Load into a pandas dataframe to get size of the columns for the database

In [86]:
df_cust = pd.read_json("../data_files/cdw_sapp_customer.json", lines=True)
df_cust.head()

,FIRST_NAME,MIDDLE_NAME,LAST_NAME,SSN,CREDIT_CARD_NO,APT_NO,STREET_NAME,CUST_CITY,CUST_STATE,CUST_COUNTRY,CUST_ZIP,CUST_PHONE,CUST_EMAIL,LAST_UPDATED
0,Alec,Wm,Hooper,123456100,4210653310061055,656,Main Street North,Natchez,MS,United States,39120,1237818,AHooper@example.com,2018-04-21T12:49:02.000-04:00
1,Etta,Brendan,Holman,123453023,4210653310102868,829,Redwood Drive,Wethersfield,CT,United States,6109,1238933,EHolman@example.com,2018-04-21T12:49:02.000-04:00
2,Wilber,Ezequiel,Dunham,123454487,4210653310116272,683,12th Street East,Huntley,IL,United States,60142,1243018,WDunham@example.com,2018-04-21T12:49:02.000-04:00
3,Eugenio,Trina,Hardy,123459758,4210653310195948,253,Country Club Road,NewBerlin,WI,United States,53151,1243215,EHardy@example.com,2018-04-21T12:49:02.000-04:00
4,Wilfred,May,Ayers,123454431,4210653310356919,301,Madison Street,ElPaso,TX,United States,79930,1242074,WAyers@example.com,2018-04-21T12:49:02.000-04:00

In [80]:
for k in df_cust.keys():
    print(k, ": ", max(df_cust[k].astype(str).map(len)))

FIRST_NAME :  10
MIDDLE_NAME :  10
LAST_NAME :  13
SSN :  9
CREDIT_CARD_NO :  16
APT_NO :  3
STREET_NAME :  19
CUST_CITY :  17
CUST_STATE :  2
CUST_COUNTRY :  13
CUST_ZIP :  5
CUST_PHONE :  7
CUST_EMAIL :  26
LAST_UPDATED :  29

In [87]:
df_credit_card = pd.read_json("../data_files/cdw_sapp_credit.json", lines=True)
df_credit_card.head()

,TRANSACTION_ID,DAY,MONTH,YEAR,CREDIT_CARD_NO,CUST_SSN,BRANCH_CODE,TRANSACTION_TYPE,TRANSACTION_VALUE
0,1,14,2,2018,4210653349028689,123459988,114,Education,78.90
1,2,20,3,2018,4210653349028689,123459988,35,Entertainment,14.24
2,3,8,7,2018,4210653349028689,123459988,160,Grocery,56.70
3,4,19,4,2018,4210653349028689,123459988,114,Entertainment,59.73
4,5,10,10,2018,4210653349028689,123459988,93,Gas,3.59

In [84]:
for k in df_credit_card.keys():
    print(k, ": ", max(df_credit_card[k].astype(str).map(len)))

TRANSACTION_ID :  5
DAY :  2
MONTH :  2
YEAR :  4
CREDIT_CARD_NO :  16
CUST_SSN :  9
BRANCH_CODE :  3
TRANSACTION_TYPE :  13
TRANSACTION_VALUE :  18

In [93]:
df_branch = pd.read_json("../data_files/cdw_sapp_branch.json", lines=True)
df_branch.head()

,BRANCH_CODE,BRANCH_NAME,BRANCH_STREET,BRANCH_CITY,BRANCH_STATE,BRANCH_ZIP,BRANCH_PHONE,LAST_UPDATED
0,1,Example Bank,Bridle Court,Lakeville,MN,55044,1234565276,2018-04-18T16:51:47.000-04:00
1,2,Example Bank,Washington Street,Huntley,IL,60142,1234618993,2018-04-18T16:51:47.000-04:00
2,3,Example Bank,Warren Street,SouthRichmondHill,NY,11419,1234985926,2018-04-18T16:51:47.000-04:00
3,4,Example Bank,Cleveland Street,Middleburg,FL,32068,1234663064,2018-04-18T16:51:47.000-04:00
4,5,Example Bank,14th Street,KingOfPrussia,PA,19406,1234849701,2018-04-18T16:51:47.000-04:00

In [94]:
for k in df_branch.keys():
    print(k, ": ", max(df_branch[k].astype(str).map(len)))

BRANCH_CODE :  3
BRANCH_NAME :  12
BRANCH_STREET :  19
BRANCH_CITY :  17
BRANCH_STATE :  2
BRANCH_ZIP :  5
BRANCH_PHONE :  10
LAST_UPDATED :  29

In [4]:
resp = requests.get("https://raw.githubusercontent.com/platformps/LoanDataset/main/loan_data.json")

df_loan = pd.DataFrame(resp.json())
df_loan.head()

,Application_ID,Gender,Married,Dependents,Education,Self_Employed,Credit_History,Property_Area,Income,Application_Status
0,LP001002,Male,No,0,Graduate,No,1,Urban,medium,Y
1,LP001003,Male,Yes,1,Graduate,No,1,Rural,medium,N
2,LP001005,Male,Yes,0,Graduate,Yes,1,Urban,low,Y
3,LP001006,Male,Yes,0,Not Graduate,No,1,Urban,low,Y
4,LP001008,Male,No,0,Graduate,No,1,Urban,medium,Y

In [5]:
for k in df_loan.keys():
    print(k, ": ", max(df_loan[k].astype(str).map(len)))

Application_ID :  8
Gender :  6
Married :  3
Dependents :  2
Education :  12
Self_Employed :  3
Credit_History :  1
Property_Area :  9
Income :  6
Application_Status :  1